/*

1-27. 编程，打印下列上三角形式的乘法九九表。
          1  2  3  4  5  6  7  8  9
         ----------------------------
          1  2  3  4  5  6  7  8  9
             4  6  8 10 12 14 16 18
                9 14 15 18 21 24 27
                  16 20 24 28 32 36
                     25 30 35 40 45
                        36 42 48 54
                           49 56 63
                              86 72
                                 81

*/
#include<stdio.h>

void main()
{
	int i,j;
	for(i=0;i<9;++i)
	    printf("%3d",i+1);
	printf("\n");
	for(i=0;i<9;++i)
	    printf("---");
	printf("\n");
	for(i=1;i<=9;++i)
	{
		for(j=1;j<i;++j)
	        printf("   ");
		for(j=i;j<=9;++j)
	        printf("%3d",i*j);
	    printf("\n");
	}

}
