//10 - 黑色星期五

/*理论基础
公元元年（也就是第一年）的第一天是星期1,以后的每一年与元年的差值取模7就可以算出该年的第一天是星期几.
c=[365*(year-1)+其中闰年的个数（闰年多一天）]%7+1;
c=((year-1)*365+((year-1)/4-(year-1)/100+(year-1)/400+1))%7；其中((year-1)/4-(year-1)/100+(year-1)/400就是其中闰年的个数,四年一闰,百年不闰,四百年再闰,所以4年的个数减去100年的个数在加上400年的个数就是其中闰年的个数了；
因为365=364+1；364%7=0；且后面的1可以加到去模公式前面去；所以可以化简成
c=(year+(year-1)/4-(year-1)/100+(year-1)/400)%7 . 
*/ 

#include <stdio.h>

int main()
{
	int year;
	scanf("%d",&year);
	int a[13]={0,12,43,71,102,132,163,193,224,255,285,316,346};
	int b[13]={0,12,43,72,103,133,164,193,225,256,286,317,347};//闰年
	int i;
	if(year%4==0&&year%100!=0||year%400==0)
	{
		for(i=1;i<=12;++i)
		    if((year*365+(year-1)/4-(year-1)/100+(year-1)/400+b[i])%7==5)
		        printf("%d,%d,13\n",year,i);		    
	}                     
	 else
	 {
	 	for(i=1;i<=12;++i)
		    if((year*365+(year-1)/4-(year-1)/100+(year-1)/400+a[i])%5==0)
		        printf("%d,%d,13\n",year,i);
	 }
	
 } 
